In [129]:
import pandas as pd
import numpy as np

sample_data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
temp_df = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]})
temp_df1 = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})
sample_city_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [4]:
#1
sample_df = pd.DataFrame(sample_data)
print(sample_df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [84]:
#2
exam_df = pd.DataFrame(exam_data, index=labels)
print(exam_df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [8]:
#3
exam_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [9]:
#4
exam_df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [10]:
#5
exam_df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [13]:
#6
exam_df.iloc[[1, 3, 5, 6], [1, 3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [20]:
#7
exam_df.loc[exam_df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [24]:
#8
print("Rows:" + str(exam_df.shape[0]))
print("Columns:" + str(exam_df.shape[1]))

Rows:10
Columns:4

In [33]:
#9
exam_df.loc[exam_df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [34]:
#10
print("Score between 15 and 20:\n", exam_df.loc[exam_df['score'].between(15, 20)])

Score between 15 and 20:
         name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [39]:
#11
print("Attempts < 2 and score > 15:\n",
      exam_df.loc[(exam_df['attempts'] < 2) & (exam_df['score'] > 15)])

Attempts < 2 and score > 15:
     name  score  attempts qualify
j  Jonas   19.0         1     yes

In [51]:
#12
print("Original df:\n", exam_df)
exam_df.loc['d', 'score'] = 11.5
print("Updated df:\n", exam_df)

Original df:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
Updated df:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [55]:
#13
print("Sum of examination attempts:\n",
      sum(exam_df['attempts']))

Sum of examination attempts:
 19

In [56]:
#14
print("Mean of all scores:\n",
      exam_df['score'].mean())

Mean of all scores:
 13.333333333333334

In [67]:
#15
print("Adding new row k to dataframe:\n")
exam_df.loc['k'] = [1, 'Suresh', 'yes', 15.5]
print(exam_df)
print("\nDeleting new row k from dataframe:\n")
exam_df.drop('k', inplace=True)
print(exam_df)

Adding new row k to dataframe:

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima     9.0        3      no
c  Katherine    16.5        2     yes
d      James     NaN        3      no
e      Emily     9.0        2      no
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
j      Jonas    19.0        1     yes
k          1  Suresh      yes    15.5

Deleting new row k from dataframe:

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

In [69]:
#16
print("Sorting dataframe by name in descending order, then score in ascending order:\n",
      exam_df.sort_values(['name', 'score'], ascending=[False, True]))

Sorting dataframe by name in descending order, then score in ascending order:
         name score attempts qualify
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
c  Katherine  16.5        2     yes
j      Jonas  19.0        1     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
b       Dima   9.0        3      no
a  Anastasia  12.5        1     yes

In [81]:
#17
print("Replacing 'qualify' column with True and False:\n")
exam_df['qualify'] = exam_df['qualify'].map({'yes': True, 'no': False})
print(exam_df)

Replacing 'qualify' column with True and False:

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [86]:
#18
print("Changing name from James to Suresh:\n" )
exam_df.loc[exam_df['name'] == 'James', 'name'] = 'Suresh'
print(exam_df)

Changing name from James to Suresh:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [89]:
#19 #20
print("Adding a new column to dataframe:\n")
exam_df['temp'] = [13, 42, 64, 6, 4, 5235, 66, 5, 34 ,53]
print(exam_df)
print("Deleting new column from dataframe:\n")
exam_df.drop('temp', axis=1, inplace=True)
print(exam_df)

Adding a new column to dataframe:

        name  score  attempts qualify  temp
a  Anastasia   12.5         1     yes    13
b       Dima    9.0         3      no    42
c  Katherine   16.5         2     yes    64
d     Suresh    NaN         3      no     6
e      Emily    9.0         2      no     4
f    Michael   20.0         3     yes  5235
g    Matthew   14.5         1     yes    66
h      Laura    NaN         1      no     5
i      Kevin    8.0         2      no    34
j      Jonas   19.0         1     yes    53
Deleting new column from dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [93]:
#21
def display_name_score(rows):
    return f"{rows['name']} {rows['score']}"

result = exam_df.apply(display_name_score, axis=1)
for res in result:
    print(res)

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

In [95]:
#22
print("Column headers:\n", exam_df.columns.tolist())

Column headers:
 ['name', 'score', 'attempts', 'qualify']

In [106]:
#23
print("Original dataframe:\n", temp_df)
temp_df.columns = ['Column1', 'Column2', 'Column3']
print("New column headers:\n", temp_df)

Original dataframe:
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New column headers:
    Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [111]:
#24
print("Original dataframe:\n", temp_df1)
print("Rows with column1 = 4:\n", temp_df1.loc[temp_df1['col1'] == 4])

Original dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows with column1 = 4:
    col1  col2  col3
1     4     5     8
3     4     7     0

In [113]:
#25
print("Original dataframe:\n", temp_df1)
temp_df1_reordered = temp_df1.iloc[:, [0, 2, 1]]
print(temp_df1_reordered)

Original dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
   col1  col3  col2
0     1     7     4
1     4     8     5
2     3     9     6
3     4     0     7
4     5     1     8

In [121]:
#26
print("Original dataframe:\n", temp_df1)
new_row = pd.DataFrame([{'col1': 12, 'col2': 44, 'col3': 5}])
temp_df1 = pd.concat([temp_df1, new_row], ignore_index=True)
print(temp_df1)

Original dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    12    44     5

In [128]:
#27
print("Original dataframe:\n", temp_df1)
new_csv = temp_df1.to_csv('new_file.csv', index=False, sep='\t')
new_tempdf1 = pd.read_csv('new_file.csv')
print(new_tempdf1)

Original dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    12    44     5
  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1
5        12\t44\t5

In [132]:
#28
print("City wise number of people:\n")
sample_city_data.groupby('city')['name'].count()

City wise number of people:

city
California     4
Georgia        2
Los Angeles    4
Name: name, dtype: int64

In [141]:
#29
print("Original dataframe:\n", temp_df1)
temp_df1.drop(temp_df1[temp_df1['col3'] == 8].index, inplace=True)
print(temp_df1)

Original dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [143]:
#30
print("Original dataframe:\n", temp_df1)
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 100)
pd.set_option('display.width', 1000)
print(temp_df1)

Original dataframe:
    col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1